app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"
---
  def index
   @employees = Employee.all

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @employee = Employee.find(params[:id])

INSERT INTO "employees" ("name", "surname", "phone", "email", "pictureUrl", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    #student_params is a method that parses the parameters to avoid injections
    @employee = Employee.create(employee_params)